api_id = "18812221"  # api id, подробнее в документации
api_hash = "4b3a8a5527fe075019839f457f2c6dbc"  # api hash, подробнее в документации

groups_id = [
    -1001694677847,
    -1001786900618
]  # список id групп в которые будет отправлять сообщения, подробнее в документации

messages = [
    """Тестовое сообщение""",
]  # список сообщений которые будем отправлять, подробнее в документации

time = 3600  # задержка

ids = "-100:20, -200:30"
ids = eval("{"+ids+"}")

print(ids[-100])
"-1001542601217: 5, -1001729898832: 10, -1001793762146: 20, -1001694677847: 8, -1001764699823: 8, -1001523785863: 10, -1001709220111: 20, -1001784288432: 10, -1001213414401: 30, -1001690578675: 10, -1001529271786: 10"
"-1001542601217, -1001729898832, -1001793762146, -1001694677847, -1001764699823, -1001523785863, -1001709220111, -1001784288432, -1001213414401, -1001690578675, -1001529271786"
